package Task6;

public class Main {
    public static void main(String[] args) {
        //TODO: Это типа такая модель компании, хз=)
        //TODO: 1)Создай класс "Компания"
        //TODO: 2)Класс сотрудник например
        //TODO: 3)в классе Компания создай массив Сотрудников
        //TODO: 4)вклассе Сотрудник Поле компания(типа компания где он работает
        //TODO: 5)в классе Компания для для массива сотрудников, сделай сеттер, который принимает сотрудника и заносит его в массив
        //TODO: 6)в классе Сотрудник создай сеттер который вносит в поле объекта эту компанию.
        //TODO: сделай и запушь.
    }
}
